{
  "quotes": [
    {
      "quote": "I hate the way you talk to me, and the way you cut your hair. I hate the way you drive my car. I hate it when you stare. I hate your big, dumb combat boots and the way you read my mind. I hate you so much it makes me sick — it even makes me rhyme. I hate the way you're always right. I hate it when you lie. I hate it when you make me laugh — even worse when you make me cry. I hate it when you're not around, and the fact that you didn't call. But mostly I hate the way I don't hate you — not even close, not even a little bit, not even at all.",
      "movie": "Ten Things I Hate About You"
    },
    {
      "quote": "People do fall in love. People do belong to each other, because that's the only chance anybody's got for real happiness.",
      "movie": "Breakfast at Tiffany's"
    },
    {
      "quote": "That moment when you kiss someone and everything around becomes hazy and the only thing in focus is you and this person, and you realize that that person is the only person that you're supposed to kiss for the rest of your life, and for one moment you get this amazing gift and you want to laugh and you want to cry because you feel so lucky that you found it and so scared that that it will go away all at the same time...",
      "movie": "Never Been Kissed"
    },
    {
      "quote": "I just sort of feel like I'm on drugs when I'm with you. Not that I do drugs. Unless you do drugs, in which case, I do them all the time.",
      "movie": "Scott Pilgrim vs. the World"
    },
    {
      "quote": "I'm hopelessly devoted to you.",
      "movie": "Grease"
    },
    {
      "quote": "Look, I guarantee there'll be tough times. I guarantee that at some point, one or both of us is gonna want to get out of this thing. But I also guarantee that if I don't ask you to be mine, I'll regret it for the rest of my life, because I know, in my heart, you're the only one for me.",
      "movie": "Runaway Bride"
    },
    {
      "quote": "I love you. I knew it the minute I met you. I'm sorry it took so long for me to catch up. I just got stuck.",
      "movie": "The Silver Linings Playbook"
    },
    {
      "quote": "She rescues him right back.",
      "movie": "Pretty Woman"
    },
    {
      "quote": "I don't want to waste any more of my life without you in it, ok?",
      "movie": "Garden State"
    },
    {
      "quote": "You make me want to be a better man.",
      "movie": "As Good As It Gets"
    },
    {
      "quote": "I've found almost everything ever written about love to be true.",
      "movie": "The Holiday"
    },
    {
      "quote": "I would give anything if you were two people, so that I could call up the one who's my friend and tell her about the one that I like so much.",
      "movie": "Broadcast News"
    },
    {
      "quote": "You erased me from your memories because you thought you were holding me back from having a full and happy life. But you made a mistake. Being with you is the only way I could have a full and happy life. You're the girl of my dreams... and apparently, I'm the man of yours.",
      "movie": "50 First Dates"
    },
    {
      "quote": "What does she want with Josh, anyway? He dresses funny, he listens to complaint rock, he's not even cute in a conventional way. I mean, he's just like this slug who hangs around the house all the time. And he's a hideous dancer, I couldn't take him anywhere. Wait a second, what am I stressing about? This is like, Josh! OK, OK, so he's kind of a Baldwin, but what would he want with Tai? She couldn't make him happy.",
      "movie": "Clueless"
    },
    {
      "quote": "In another life, I think I would have really liked just doing laundry and taxes with you.",
      "movie": "Everything Everywhere All at Once"
    },
    {
      "quote": "I want to owe you things.",
      "movie": "Adventureland"
    },
    {
      "quote": "Don't forget: I'm also just a girl, standing in front of a boy, asking him to love her.",
      "movie": "Notting Hill"
    },
    {
      "quote": "I don't want to sound foolish, but remember love is what brought you here. And if you've trusted love this far, don't panic now. Trust it all the way.",
      "movie": "If Beale Street Could Talk"
    },
    {
      "quote": "You have bewitched me, body and soul, and I love, I love, I love you. I never wish to be parted from you from this day on.",
      "movie": "Pride and Prejudice"
    },
    {
      "quote": "I’ve fallen in love. I’m an ordinary woman. I didn’t think such violent things could happen to ordinary people.",
      "movie": "Brief Encounter"
    },
    {
      "quote": "Love isn't patient, and kind, and humble. Love is messy, and horrible, and selfish, and bold. It's not about finding your perfect half. It's the trying, and reaching, and failing.",
      "movie": "The Half of It"
    },
    {
      "quote": "I wanted it to be you. I wanted it to be you so badly.",
      "movie": "You've Got Mail"
    },
    {
      "quote": "I'm done being scared. I'm done living in a world where I don't get to be who I am. I deserve a great love story.",
      "movie": "Love, Simon"
    },
    {
      "quote": "I can't see anything I don't like about you.",
      "movie": "Eternal Sunshine of the Spotless Mind"
    },
    {
      "quote": "I'll play you. For what? Your heart.",
      "movie": "Love and Basketball"
    },
    {
      "quote": "Love is patient, love is kind, love means slowly losing your mind.",
      "movie": "27 Dresses"
    },
    {
      "quote": "It seems to me that love is everywhere. Often, it's not particularly dignified or newsworthy, but it's always there...if you look for it, I've got a sneaky feeling you'll find that love actually is all around.",
      "movie": "Love Actually"
    },
    {
      "quote": "I am done being scared, and I am done keeping secrets. I love you.",
      "movie": "The Happiest Season"
    },
    {
      "quote": "In my opinion, the best thing you can do is find someone who loves you for exactly what you are. Good mood, bad mood, ugly, pretty, handsome, what have you.",
      "movie": "Juno"
    },
    {
      "quote": "I know you must think I'm combative, neurotic, picky — and maybe I am. But the weird thing is I've never had to be anything but myself with you right from the beginning. And with you, I feel like I can do anything, say anything, try anything. And that's the life I want. I want an adventure with you. You don't understand; we're supposed to be together.",
      "movie": "Something New"
    },
    {
      "quote": "I like you very much. Just as you are.",
      "movie": "Bridget Jones's Diary"
    },
    {
      "quote": "Kiss me. Now. In front of all these people.",
      "movie": "Saving Face"
    },
    {
      "quote": "Look, I can't let you go without knowing... That even with the distance, and it concerns your family, we might still have something. Don't you think?",
      "movie": "Bend It Like Beckham"
    },
    {
      "quote": "Sasha Tran, can I hold your purse for you?",
      "movie": "Always Be My Maybe"
    },
    {
      "quote": "You make me happy. Even when you're awful, I would rather be with you, even the you that you seem to think is diminished, than with anyone else in the world.",
      "movie": "Me Before You"
    },
    {
      "quote": "There's no one like you, Covey.",
      "movie": "To All the Boys I've Loved Before"
    },
    {
      "quote": "Why me? Because you saw me when I was invisible.",
      "movie": "The Princess Diaries"
    },
    {
      "quote": "You don't need other people to validate or define you.",
      "movie": "The Incredible Jessica James"
    },
    {
      "quote": "Just shut up! Here... I wanna marry you because you're the first person I wanna look at when I wake up in the morning, and the only one I wanna kiss goodnight. Because the first time that I saw these hands, I couldn't imagine not being able to hold them. But mainly, when you love someone as much as I love you, getting married is the only thing left to do. So, will you, um, marry me?",
      "movie": "Definitely, Maybe"
    },
    {
      "quote": "Let me tell you something: This here, right now, at this very moment, is all that matters to me.",
      "movie": "Love Jones"
    },
    {
      "quote": "If you love someone, you say it, you say it right then, out loud. Otherwise, the moment just…passes you by.",
      "movie": "My Best Friend's Wedding"
    },
    {
      "quote": "Love isn't easy; that's why they call it love.",
      "movie": "The Big Sick"
    },
    {
      "quote": "What does your 'I wanna kiss you face' look like? It looks a lot like this.",
      "movie": "The Lovebirds"
    },
    {
      "quote": "You can search the entire universe and never find a being more worthy of love than yourself.",
      "movie": "Isn't It Romantic"
    },
    {
      "quote": "Because it was us. We were magic.",
      "movie": "Someone Great"
    },
    {
      "quote": "I knew I’d never be able to remember what Nina wore that day. But I also knew I’d never forget the way she looked.",
      "movie": "Father of the Bride"
    },
    {
      "quote": "You had me at hello.",
      "movie": "Jerry Maguire"
    },
    {
      "quote": "Well, I'm certainly glad to see you again. I-I'm certainly glad to see you, as well.",
      "movie": "The Great Gatsby"
    },
    {
      "quote": "Kiss me. Kiss me as if it were the last time.",
      "movie": "Casablanca"
    },
    {
      "quote": "Death cannot stop true love. All it can do is delay it for a while.",
      "movie": "The Princess Bride"
    },
    {
      "quote": "I guess when you’re young, you just believe there’ll be many people…you’ll connect with. Later in life, you realize it only happens a few times.",
      "movie": "Before Sunset"
    },
    {
      "quote": "I will return. I will find you. Love you. Marry you. And live without shame.",
      "movie": "Atonement"
    },
    {
      "quote": "You will never age for me, nor fade, nor die.",
      "movie": "Shakespeare in Love"
    },
    {
      "quote": "Listen to me, mister. You’re my knight in shining armor. Don’t you forget it.",
      "movie": "On Golden Pond"
    },
    {
      "quote": "Swoon. I’ll catch you.",
      "movie": "The English Patient"
    },
    {
      "quote": "I don’t know if we each have a destiny, or if we’re all just floating around accidental—like on a breeze—but I think maybe it’s both. Maybe both is happening at the same time. I miss you, Jenny. If there’s anything you need, I won’t be far away.",
      "movie": "Forrest Gump"
    },
    {
      "quote": "I think I'd miss you even if we'd never met.",
      "movie": "The Wedding Date"
    },
    {
      "quote": "I love you without knowing how, why, or even from where.",
      "movie": "Patch Adams"
    },
    {
      "quote": "The entire 'I Wanna Grow Old With You' song",
      "movie": "The Wedding Singer"
    },
    {
      "quote": "You were the only thing in my life that was real.",
      "movie": "Blue is the Warmest Color"
    },
    {
      "quote": "You could make it true. What are legends anyway but stories about ordinary people doing extraordinary things? Of course, it takes courage and imagination... not everybody has that. I may be an old fraud Daniel, but I do know this: something that two people who are in love create together against impossible odds, can hold them together... forever.",
      "movie": "A Little Romance"
    },
    {
      "quote": "They say when you meet the love of your life, time stops, and that’s true.",
      "movie": "Big Fish"
    },
    {
      "quote": "The greatest thing you’ll ever learn is just to love, and be loved in return.",
      "movie": "Moulin Rouge"
    },
    {
      "quote": "It doesn’t matter if the guy is perfect or the girl is perfect, as long as they are perfect for each other.",
      "movie": "Good Will Hunting"
    },
    {
      "quote": "You should be kissed and often, and by someone who knows how.",
      "movie": "Gone with the Wind"
    },
    {
      "quote": "Can't you see? Every step I have taken, since I was that little girl on the bridge, was to bring me closer to you.",
      "movie": "Memoirs of a Geisha"
    },
    {
      "quote": "Winning that ticket, Rose, was the best thing that ever happened to me… it brought me to you.",
      "movie": "Titanic"
    },
    {
      "quote": "I would rather have had one breath of her hair, one kiss of her mouth, one touch of her hand, than eternity without it. One.",
      "movie": "City of Angels"
    },
    {
      "quote": "I vow to fiercely love you in all your forms, now and forever. I promise to never forget that this is a once in a lifetime love.",
      "movie": "The Vow"
    },
    {
      "quote": "It would be a privilege to have my heart broken by you.",
      "movie": "The Fault in Our Stars"
    },
    {
      "quote": "It’s like in that moment the whole universe existed just to bring us together.",
      "movie": "Serendipity"
    },
    {
      "quote": "I am here and I am looking at her. And she is so beautiful. I can see it. This one moment when you know you’re not a sad story. You are alive, and you stand up and see the lights on the buildings and everything that makes you wonder.",
      "movie": "The Perks of Being a Wallflower"
    },
    {
      "quote": "You’re the first boy I ever kissed, Jake, and I want you to be the last.",
      "movie": "Sweet Home Alabama"
    },
    {
      "quote": "Love is passion, obsession, someone you can’t live without. If you don’t start with that, what are you going to end up with?",
      "movie": "Meet Joe Black"
    },
    {
      "quote": "What I really want to do with my life — what I want to do for a living — is I want to be with your daughter. I’m good at it.",
      "movie": "Say Anything"
    },
    {
      "quote": "I’ve come here with no expectations, only to profess, now that I am at liberty to do so, that my heart is, and always will be, yours.",
      "movie": "Sense & Sensibility"
    },
    {
      "quote": "You don't marry someone you can live with, you marry the person you cannot live without.",
      "movie": "P.S. I Love You"
    },
    {
      "quote": "You could travel endlessly around those curves. Goes on forever. That's infinity.",
      "movie": "The Summer I Turned Pretty"
    },
    {
      "quote": "That is too sad for me to accept, my lord. Life is too cruel... if we cease to believe in love, why would we want to live?",
      "movie": "The Vampire Diaries"
    },
    {
      "quote": "You are the bane of my existence and the object of all my desires.",
      "movie": "Bridgerton"
    },
    {
      "quote": "Some people are worth melting for.",
      "movie": "Frozen"
    },
    {
      "quote": "I’m scared of walking out of this room and never feeling the rest of my whole life the way I feel when I’m with you.",
      "movie": "Dirty Dancing"
    },
    {
      "quote": "To love, you have to be brave. To be brave, you have to be in love.",
      "movie": "Crazy Rich Asians"
    },
    {
      "quote": "Our love is like the wind. I can't see it, but I can feel it.",
      "movie": "A Walk To Remember"
    },
    {
      "quote": "If you love someone, set them free. If they come back, they’re yours. If they don’t, they never were.",
      "movie": "Indecent Proposal"
    },
    {
      "quote": "You want the moon? Just say the word and I'll throw a lasso around it and pull it down.",
      "movie": "It's A Wonderful Life"
    },
    {
      "quote": "You meet thousands of people and none of them really touch you. And then you meet one person and your life is changed forever.",
      "movie": "Love & Other Drugs"
    },
    {
      "quote": "It was a million tiny little things that, when you added them all up, they meant we were supposed to be together… and I knew it. I knew it the first time I touched her. It was like coming home, only to no home I'd ever known.",
      "movie": "Sleepless in Seattle"
    },
    {
      "quote": "The best love is the kind that awakens the soul and makes us reach for more, that plants a fire in our hearts and brings peace to our minds. And that’s what you’ve given me. That’s what I hope to give you forever.",
      "movie": "The Notebook"
    },
    {
      "quote": "I came here tonight because when you realize you want to spend the rest of your life with somebody, you want the rest of your life to start as soon as possible.",
      "movie": "When Harry Met Sally"
    },
    {
      "quote": "I think I fell in love with you. A little bit. Or... a lot.",
      "movie": "XO, Kitty"
    },
    {
      "quote": "I've spent my entire life looking for the perfect guy. But there's perfect, and there's perfect for me.",
      "movie": "Love Hard"
    }
  ]
}